/**
 * 区分管理
 */
class CodeManager {
  /** 勋章状态区分对应的名称 */
  static mdlCd = {
    '01': '活期勋章',
    '02': '定期勋章',
    '03': '已支出勋章',
  };

  /** 支出类型区分(支出账单说明区分)对应的名称 */
  static epsTyCd = {
    '01': '日常消费',
    '02': '提现',
    '03': '罚扣',
  }

  /** 还款类型区分对应的名称 */
  static repayCd = {
    '01': '偿还本金',
    '02': '偿还利息'
  }

  /** 勋章来源说明区分(收入账单说明区分)对应的名称 */
  static mdlSrcTipCd = {
    '01': '学习奖励',
    '02': '日常赚取',
    '03': '长辈认同',
  }

  /** 经办人区分对应的名称 */
  static pchCd = {
    '01': '妈妈',
    '02': '爸爸',
  }

  /**
   * 账单事件区分对应的名称
   */
  static billActionCd = {
    '01': '新增活期存储',
    '02': '新增定期存储',
    '03': '活期转定期',
    '04': '定期转活期',
    '05': '消费支出',
    '06': '定期自动到期',
    '07': '抽奖',
    '08': '借贷',
    '09': '还款'
  }

  /** 根据code值获取code名称 */
  static getCodeName(child, code) {
    return CodeManager[child][code];
  }
}