/**
 * 区分管理
 */
class CodeManager {
  /** 勋章状态区分对应的名称 */
  static mdlCd = {
    '01': '活期勋章',
    '02': '定期勋章',
    '03': '已支出勋章',
  };

  /** 支出类型区分对应的名称 */
  static epsTyCd = {
    '01': '日常消费',
    '02': '提现',
    '03': '罚扣'
  }

  /**
   * 勋章来源区分对应的名称
   */
  static mdlSrcCd = {
    /** 新增 */
    '01': '新增',
    /** 活期转定期 */
    '02': '活期转定期',
    /** 定期转活期 */
    '03': '定期转活期',
  }

  /** 勋章来源说明区分(账单说明区分)对应的名称 */
  static mdlSrcTipCd = {
    '01': '学习奖励',
    '02': '日常赚取',
    '03': '长辈认同',
    '04': '抽奖获得',
    '05': '定期利息'
  }

  /** 经办人区分对应的名称 */
  static pchCd = {
    '01': '妈妈',
    '02': '爸爸',
  }

  /** 存储类型区分对应的名称 */
  static saveTpCd = {
    '01': '活期勋章',
    '02': '定期勋章',
  }

  /**
   * 账单事件区分对应的名称
   */
  static billActionCd = {
    '01': '新增活期存储',
    '02': '新增定期存储',
    '03': '活期转定期',
    '04': '定期转活期',
    '05': '日常消费',
    '06': '提现',
    '07': '罚扣',
  }

  /** 根据code值获取code名称 */
  static getCodeName(child, code) {
    return CodeManager[child][code];
  }
}