/**
 * 勋章状态区分
 */
const mdlCd = {
  /** 活期勋章 */
  code_01: '01',
  /** 定期勋章 */
  code_02: '02',
  /** 借用勋章 */
  code_03: '03',
  /** 已还款勋章 */
  code_04: '04',
  /** 已支出勋章 */
  code_05: '05',
  /** 已提现勋章 */
  code_06: '06',
  /** 罚扣勋章 */
  code_07: '07',
}

/**
 * 支出类型区分
 */
const epsTyCd = {
  /** 消费支出 */
  code_01: '01',
  /** 提现支出 */
  code_02: '02',
}

/**
 * 勋章来源说明区分
 */
const mdlSrcCd = {
  /** 学习奖励 */
  code_01: '01',
  /** 日常奖励 */
  code_02: '02',
  /** 长辈奖励 */
  code_03: '03',
}

/**
 * 经办人区分
 */
const pchCd = {
  /** 妈妈 */
  code_01: '01',
  /** 爸爸 */
  code_02: '02',
}

/**
 * 存储类型区分
 */
const saveTpCd = {
  /** 活期勋章 */
  code_01: '01',
  /** 定期勋章 */
  code_02: '02',
}



